app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description") VALUES ($1, $2) RETURNING "id"  [["title", "New Task 1"], ["description", "Here's a new task!"]]
---
    task = Task.new({
      title: params[:task][:title],
      description: params[:task][:description]
      })

    task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = $1, "description" = $2 WHERE "tasks"."id" = $3  [["title", "Actually New Task"], ["description", "Edited task"], ["id", 1]]
---
    task = Task.find(params[:id])
    task.update({
      title: params[:task][:title],
      description: params[:task][:description]
      })

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
  def destroy
    Task.destroy(params[:id])